var express = require('express');
var app = express();

var arr = [{
        'biaoti': 'one',
        'shijian': '2017年4月24日14:22:35',
        'zuoze': 'one',
        'neirong': '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容'
    },
    {
        'biaoti': 'two',
        'shijian': '2017年4月24日14:22:35',
        'zuoze': 'two',
        'neirong': '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容'
    },
    {
        'biaoti': 'three',
        'shijian': '2017年4月24日14:22:35',
        'zuoze': 'three',
        'neirong': '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容'
    },
    {
        'biaoti': 'four',
        'shijian': '2017年4月24日14:22:35',
        'zuoze': 'four',
        'neirong': '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容'
    },
    {
        'biaoti': 'five',
        'shijian': '2017年4月24日14:22:35',
        'zuoze': 'five',
        'neirong': '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容'
    }
]

app.use(express.static('./public'));

app.get('/news', function(req, res) {
    res.json(arr);
});

app.listen(3000);